src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>(Общ) Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициентВхождения</name>
    <comment>(Упр) Весовой коэффициент вхождения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <comment>(Регл) Номер ГТД по умолчанию</comment>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>(Общ) Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>уатВидГруза</name>
    <type>
      <types>CatalogRef.уатВидыГрузов</types>
    </type>
  </attributes>
  <attributes>
    <name>уатВидУпаковкиДляРоссыпи</name>
    <type>
      <types>CatalogRef.уатВидыУпаковки_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>уатВидУпаковкиОсновной</name>
    <type>
      <types>CatalogRef.уатВидыУпаковки_уэ</types>
    </type>
  </attributes>
  <attributes>
    <name>уатКоличествоВОсновнойУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>уатКоличествоВУпаковкеДляРоссыпи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УслугаРегл</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьЭтикетокДляКаждойЕдиницыНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕдиницыИзмерения</name>
  <comment>(Общ)</comment>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НоменклатурныеГруппы</owners>
  <attributes>
    <name>ЕдиницаПоКлассификатору</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Номенклатура/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		ЕдиницаХраненияОстатков = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		
		// Заполнение реквизитов по умолчанию.
		Если Ссылка.Пустая() Тогда
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ЕдиницаИзмерения) Тогда
				ЭтотОбъект.ЕдиницаИзмерения = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
					ПользователиКлиентСервер.ТекущийПользователь(), "ОсновнаяЕдиницаПоКлассификатору");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СтавкаНДС) Тогда
				ЭтотОбъект.СтавкаНДС = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
					ПользователиКлиентСервер.ТекущийПользователь(), "ОсновнаяСтавкаНДС");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ДатаСоздания) Тогда
				ДатаСоздания = ТекущаяДата();
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
			Услуга = ВидНоменклатуры.Услуга;
		КонецЕсли;
		
		Если Не Услуга И Не ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить единицу измерения",, "Объект.ЕдиницаИзмерения",, Отказ);
		Иначе
			// Препятствует поиску и удалению дублей. Задача (С000459724)
			
			// Проверка владельца единицы хранения остатков.
			//Если ЗначениеЗаполнено(ЕдиницаХраненияОстатков)
			//		И ЕдиницаХраненияОстатков.Владелец <> Ссылка Тогда
			//	ТекстНСТР = НСтр("en='Storage unit for the remains of products and services ""%1"" is incorrectly specified owner!';ru='У единицы хранения остатков номенклатуры ""%1"" неверно указан владелец!'");
			//	ТекстСообщения = СтрШаблон(ТекстНСТР, СокрЛП(Ссылка));
			//	уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстСообщения, Отказ);
			//КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
		
	// Подстановка единицы хранения остатков. 
	// Выполнится в данном событии, когда объект был ранее записан в ИБ. 
	Если НЕ ЭтоГруппа Тогда
		ПроверитьЕдиницуХраненияОстатков(Отказ, "ПередЗаписью");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Подстановка единицы хранения остатков
	// выполнится в данном событии, когда запись объекта происходит впервые
	Если НЕ ЭтоГруппа Тогда
		ПроверитьЕдиницуХраненияОстатков(Отказ, "ПриЗаписи");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ЭтоГруппа Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидНоменклатуры");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Родитель") Тогда
		ВидНоменклатурыРодителя = ДанныеЗаполнения.Родитель.ВидНоменклатуры;
		Если ЗначениеЗаполнено(ВидНоменклатурыРодителя) Тогда
			ВидНоменклатуры = ВидНоменклатурыРодителя;
			Услуга          = ВидНоменклатурыРодителя.Услуга;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура записывает единицу хранения остатков номенклатуры.
//
Процедура ПроверитьЕдиницуХраненияОстатков(Отказ, Событие = "ПередЗаписью")
	
	// Если единица хранения остатков заполнена, ничего делать не нужно.
	Если ЗначениеЗаполнено(ЭтотОбъект.ЕдиницаХраненияОстатков) Тогда
		Возврат;
	КонецЕсли;

	// Для услуг единица измерения не является обязательным реквизитов.
	Если Услуга И НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		Возврат;
	КонецЕсли;
	
	// До записи в ИБ ссылка еще не существует, поэтому единица хранения остатков не может быть создана.	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// Поиск существующего элемента в базе данных по владельцу.
	ВыборкаЕдиниц = Справочники.ЕдиницыИзмерения.Выбрать(, Ссылка);
	
	Если ВыборкаЕдиниц.Следующий() Тогда
		НайденнаяЕдиница = ВыборкаЕдиниц.Ссылка;
	Иначе
		НайденнаяЕдиницаОбъект = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		НайденнаяЕдиницаОбъект.Наименование            = ЕдиницаИзмерения.Наименование;
		НайденнаяЕдиницаОбъект.ЕдиницаПоКлассификатору = ЕдиницаИзмерения;
		НайденнаяЕдиницаОбъект.Коэффициент             = 1;
		НайденнаяЕдиницаОбъект.Владелец                = Ссылка;

		Попытка
			НайденнаяЕдиницаОбъект.Записать();
		Исключение
			ТекстНСТР = НСтр("en='Failed to record unit of storage of remains:';ru='Не удалось записать единицу хранения остатков:'") + " ";
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР + ОписаниеОшибки(), Отказ);
			Возврат;
		КонецПопытки;

		НайденнаяЕдиница = НайденнаяЕдиницаОбъект.Ссылка;
	КонецЕсли;    
	
	// Подстановка новой единицы хранения остатков в реквизит текущего объекта.
	ЕдиницаХраненияОстатков = НайденнаяЕдиница;
	
	// Событие "ПриЗаписи" вызывается после записи объекта в базу данных.
	// Необходимо записать объект повторно, чтобы новая единица хранения остатков записалась в БД.
	Если Событие = "ПриЗаписи" Тогда 
		Попытка
			Записать();	
		Исключение
			ТекстНСТР = НСтр("en='Failed to write products and services:';ru='Не удалось записать номенклатуру:'") + " ";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР + ОписаниеОшибки());
			Отказ = Истина;
		КонецПопытки; 
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЕдиницуХраненияОстатков()

#КонецОбласти

#КонецЕсли
